# Numeric Datatype in pandas

In [9]:
import pandas as pd

In [10]:
#creating a dataframe with integer data
data={'age':[25,30,26,28,22,40,25],
     'salary':[5000,6500,7000,8500,7500,5900,8000]}
df=pd.DataFrame(data)
df

   age  salary
0   25    5000
1   30    6500
2   26    7000
3   28    8500
4   22    7500
5   40    5900
6   25    8000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     7 non-null      int64
 1   salary  7 non-null      int64
dtypes: int64(2)
memory usage: 244.0 bytes

In [12]:
df.dtypes

age       int64
salary    int64
dtype: object

In [13]:
#changing data type to int32
df['age']=df['age'].astype('int32')
df['salary']=df['salary'].astype('int32')

In [14]:
df

   age  salary
0   25    5000
1   30    6500
2   26    7000
3   28    8500
4   22    7500
5   40    5900
6   25    8000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     7 non-null      int32
 1   salary  7 non-null      int32
dtypes: int32(2)
memory usage: 188.0 bytes

In [16]:
2**32

4294967296